# Common values, used all over the application

select.choose=- vali -
common.form.valid=Form is valid.

common.Description=Kirjeldus
common.Choose=Vali
common.button=nupp
common.Button=Nupp
button.add=Lisa
button.change=Muuda
button.back=Tagasi
button.cancel=T\u00fchista
button.retry=Korda
button.search=Otsi
button.clear=T\u00fchjenda
button.save=Salvesta
button.ready=OK
button.print=Tr\u00fcki

list.address=Aadress

common.Showing=Kuvatakse
common.Total=Kokku
common.firstName=Nimi
common.lastName=Perekonnanimi
common.email=e-mail
common.no=ei
common.yes=jah
common.description=Kirjeldus
common.code=Kood
common.date=Kuup\u00e4ev
common.datetime=Ajahetk
common.time=Kellaaeg
common.module=Moodul
common.name=Nimi
common.department=\u00dcksus
common.subdepartment=All\u00fcksus
common.insurer=Kindlustaja
common.float=Ujukomaarv
common.textbox=tekstiv\u00e4li
common.Textbox=Tekstiv\u00e4li
common.country=riik
common.Country=Riik
common.Submit=Soorita p\u00e4ring
common.Delete=Kustuta
common.Remove=Kustuta
common.Edit=Muuda
common.View=Vaata

image.alt.edit=Redigeeri
image.alt.delete=Kustuta
image.alt.info=Info
image.alt.history=Muutuste ajalugu

Checkbox=M\u00e4rkeruut

#date
# TODO move to domain?
date_month_0=Jaanuar
date_month_1=Veebruar
date_month_2=M\u00e4rts
date_month_3=Aprill
date_month_4=Mai
date_month_5=Juuni
date_month_6=Juuli
date_month_7=August
date_month_8=September
date_month_9=Oktoober
date_month_10=November
date_month_11=Detsember

date_day_1=E
date_day_2=T
date_day_3=K
date_day_4=N
date_day_5=R
date_day_6=L
date_day_7=P

searchform.notenoughdata=Ebapiisavalt andmeid otsinguks

#demo
demo_filteredinput=Filtriga sisestusv\u00e4li
demo.filteredinput.filterchars=Filtreeritavad m\u00e4rgid
demo.filteredinput.input=Filtreeritav sisestusv\u00e4li
demo_automaticForm_title=Automaatsed vormielemendid
demo.onchangelistenertest.http=OnChange kuularite test (HTTP)
demo.onchangelistenertest.ajaxanywhere=OnChange kuularite test (AjaxAnyWhere)
demo.onchangelistenertest.autocomplete=OnChange kuularite test (Widget action, AjaxAnyWhere submit)
demo.suggestive.textinput=Vihjetega sisestusv\u00e4li

demo.showAll=Kuva k\u00f5ik.
demo.showPartial=Kuva lehek\u00fclgede kaupa.

#examples menu
Management=Haldus
Persons=Persoonid
Companies=Kompaniid
Contracts=Lepingud
Samples=N\u00e4ited
Demos=Demod
Lists=Listid
View=Vaata
View_Edit=Vaata/Muuda
View_Add=Vaata/Lisa
Add=Lisa
Edit=Muuda
Error=Viga
Editable_List_Memory=Editable List (Memory)
Editable_List_Backend=Editable List (Backend)
Simple_Form=Lihtne Form
Simple_List=Lihtne List
Search_Form=Otsinguvorm
Display_Form=Display Form
Editable_List=Editable List
In_memory_editable_list=In memory editable list
Editable_checkbox_list=Editable checkbox list
Displayable_editable_list=Displayable editable list
Contacts_SubBeanList=Contacts (SubBeanList)
Complex_Form=AJAXikasutusega vorm
Complex_Form_HTTP=Tavaline vorm
Rich_Text_Editor=Rich editor
Multi_List=Multiple Lists
File_Upload=Faili \u00fcleslaadimine
Error_on_init=Viga initsialiseerimisel
Error_on_event=Error on Event
Error_on_render=Viga renderdamisel
Simple=Lihtsad
Advanced=Edasij\u00f5udnutele
Invisible_Element_Form=N\u00e4htamatu elemendiga vorm
Popup_Example=Popup example
MultiSelect=M\u00e4rkeruudud
AutoComplete=Sisestusvihjed 
Form_Lists=Form lists
Embedded_Form_List=Embedded form list
Misc=Varia
Redirecting=Redirecting
RadioSelect=Raadionupud
Error_on_ajax_request=Viga AJAXi p\u00e4ringul
OnChangeListeners=OnChange kuularid
Form_with_Actions=Form koos Action'itega
Trees=Puud
Simple_Tree=Lihtne puu
Complex_Tree=Natuke keerukam puu
Tree_with_Unsynchronized_Actions=S\u00fcnkroniseerimata actionid
Advanced_Popup=Keerukamad popupid
Context_Menus=Kontekstmen\u00fc\u00fcd
Tabs=Sakid
Tabs_Demo=Sakid
Modal_Dialog=Modaalne dialoog
Easy_AJAX_Update_Regions=Lihtne AJAX uuendusregioonide abil
TreeComponent=Puukomponent
List=List sortimise ja lehek\u00fclgede toega
ComboTextInput=Kombineeritud valiku- ja tekstisisestusv\u00e4li
Seamless_Validation=Taustvalidatsiooniga vorm
Serverside_Polling=Perioodiline andmeuuendus
Cooperative_Form=Koost\u00f6\u00f6aldis vorm

#'complex' ajaxian form
natures.beasts=Looduse imed

#easy ajax
easyajax.intro=Kahe sellel lehek\u00fcljel paikneva komponendi programmikood on identne. Sellest hoolimata k\u00e4ituvad need komponendid veidi erinevalt &mdash; \u00fclemine komponent suhtleb serveriga r\u00e4\u00e4kides HTTP protokolli traditsioonilisel viisil, alumine aga <i>XMLHttpRequest</i> objekti kapseldatuna. Erinevus tuleneb vaatest &mdash; teise komponendi vaatemall defineerib paari rea abil uuendatavad regioonid, mis v\u00f5imaldavad kerge vaevaga k\u00f5ik lehed kasutajas\u00f5bralikul moel k\u00e4ituma panna &mdash; p\u00e4ringud mis as\u00fcnkroonselt uuendavad vaid osa lehek\u00fclge v\u00f5imaldavad l\u00f5ppkasutajal p\u00e4ringu kestmise ajal t\u00f6\u00f6protsessi j\u00e4tkata ilma pausita vastuse ootamise ajal.

#friendly update
ufriendly.component.title=Koost\u00f6\u00f6aldis vorm
ufriendly.component.intro=Sellel lehel olev vorm n\u00f6uab vaid minimaalse andmehulga sisestamist. K\u00f6ik mis on v\u00f6imalik juba sisestatud andmetest tuletada, tuletatakse. K\u00e4esoleval vormil saab p\u00e4rast \u00e4riregistrinumbri t\u00e4itmist k\u00f5ik \u00fclej\u00e4\u00e4nud andmed k\u00fcsida tsentraalsest registrist. Samal ajal saab kasutaja j\u00e4tkata arve v\u00e4ljade t\u00e4itmist.
ufriendly.component.getdata=Anna kliendi andmed \u00e4riregistrist
ufriendly.component.centralfirmid=\u00c4riregistrinumber
ufriendly.component.registryaddress=Registriaadress
ufriendly.component.postaladdress=Postiaadress
ufriendly.component.bankaccount=Kontonumber
ufriendly.component.vatidentifier=K\u00e4ibemaksukohuslase number
ufriendly.component.firmtype=Firma t\u00fc\u00fcp
ufriendly.component.invoice.id=Arve number
ufriendly.component.invoice.date=Kuup\u00e4ev
ufriendly.component.invoice.sum=Summa
ufriendly.public.limited=AS
ufriendly.npo=MT\u00dc
ufriendly.private.limited=O\u00dc
ufriendly.cform.reset=T\u00fchjenda vorm

#context menu
context.menu.compheader=Kustomiseeritud kontekstmen\u00fc\u00fcga komponent
context.menu.intro=Hiire paremklikiga avanevat kontekstmen\u00fc\u00fcd on v\u00f5imalik rakenduse jaoks redefineerida. Erinevaid kustomiseeritud kontekstmen\u00fc\u00fcd saab kasutada tervel lehek\u00fcljel, listielementidel, \u00fcksikutel sisestusv\u00e4ljadel &mdash; igal komponendil mis seda vajada v\u00f5iks! 
context.menu.howto=Tehes paremkliki komponendi sees avaneb siin n\u00e4ites kahetasemeline kontekstmen\u00fc\u00fc.
context.menu.ChangeSex=Vaheta sugu

#simple list sorting and paging
simple.list.sort.page=Lihtne list sorteerimise ja lehek\u00fcljenavigatsiooni toega
simple.list.rolistintro=Hulga mudelobjektide vaateresiimi pakkumine on t\u00f5eliselt lihtne. Arendaja peab vaid m\u00e4\u00e4rama kasutatavate mudelobjektide klassi ja kuvatavad v\u00e4ljad ning  <a href="http://www.araneaframework.org/docs/1.1/javadoc/org/araneaframework/uilib/list/BeanListWidget.html">BeanListWidget</a>  klass saab hakkama \u00fclej\u00e4\u00e4nuga. Lehek\u00fcljenavigatsiooni ja vaikesorteerimist pakutakse tervikuna m\u00e4lus paikneva listi puhul ilma ainsagi lisakoodireata.
simple.list.howtonavigate=Sorteerimist saab proovida klikkides listi p\u00e4ises paiknevatel veerunimedel, lehek\u00fcljenavigatsiooni aga listi jaluses paikneva navigatsiooniriba abil.

#seamless validation form
seamless.bg.form=Taustal toimuva validatsiooniga vorm
seamless.withoutbg.form=P\u00e4ringul valideeritav vorm
seamless.appointmentdate=Kokkusaamise kuup\u00e4ev
seamless.appointmenttime=Kokkusaamise kellaaeg
seamless.room=Kokkusaamise koht
seamless.attendees=Osav\u00f5tjad
seamless.intro=Kiire tagasiside on rakendustes \u00e4\u00e4rmiselt oluline &mdash; kasutajal ei tohiks lasta valede eelduste alusel palju t\u00f6\u00f6d teha, et l\u00f5puks n\u00e4idata veateadet valeandmete kohta. Aranea vormid v\u00f5imaldavad kasutada serveripoolset taustvalidatsiooni et v\u00e4ltida sellise probleemi teket. Valideerimine toimub as\u00fcnkroonselt ega h\u00e4iri kasutaja andmesisestust ning siis kui kogu vorm l\u00f5puks serveri poole teele saadetakse sisaldab see vaid korrektseid andmeid.
seamless.howto=Lehel olevast kahest vormis \u00fclemist valideeritakse ainult p\u00e4ringu sooritamisel, alumine aga kasutab taustvalidatsiooni. Katsetada saab vormidesse erinevaid v\u00e4\u00e4rtusi sisestades. T\u00e4helepanu tasub p\u00f6\u00f6rata sellele, et m\u00f5ned kohtumispaigad v\u00f5ivad olla juba h\u00f5ivatud ning k\u00f5ik ei saa kohale tulla.
seamless.rooms.atrium=Aatrium
seamless.rooms.olympic=Olympic Kasiino
seamless.rooms.colosseum=Kolosseum
seamless.rooms.rld=Punaste laternate rajoon
seamless.rooms.warroom=Kindralstaap
seamless.room.not.available=Kokkusaamispaik ''{0}'' on h\u00f5ivatud
seamless.attendees.not.available=''{0}'' ei saa kohtumisest osa v\u00f5tta

#autocomplete release demo
release.ac.onchangetext=V\u00e4\u00e4rtus muutus ja on n\u00fc\u00fcd:
release.ac.submitvalid=Vormist loetud v\u00e4\u00e4rtus oli
ac.demo.title=Vihjetega sisestusv\u00e4ljad
ac.demo.intro=V\u00e4ga sageli kasutajad ei tea t\u00e4pselt mida nad teha soovivad v\u00f5i tegema peaksid. Sisestusvihjed aitavad neil algsest krambist \u00fcle saada ning \u00f5igekeelselt sisestada ka pikav\u00f5itu sisendeid :)
ac.demo.howto=Kui allpool asuvasse tekstiv\u00e4lja sisestada v\u00e4hemalt \u00fcks m\u00e4rk, k\u00fcsib brauser serverilt sisestusvihjeid (milleks antud juhul on riiginimed). Kasutaja ei pea loomulikult piirduma etteantud valikutega, 'M\u00e4gi-Karabahh' on samuti t\u00e4iesti valiidne sisend.

#combotextselectinput
combo.demo.fieldinput=Konsultandi nimi
combo.intro=Antud v\u00e4ljas on \u00fchendatud tekstisisestusv\u00e4lja ja valikuv\u00e4lja omadused, mis lihtsustab tunduvalt pikkade klassifikaatorv\u00e4\u00e4rtuste kasutamist lehek\u00fcljel. N\u00e4iteks mitmesajaelemendilises rippmen\u00fc\u00fcs.
combo.submitmessage=Sisestatud v\u00e4\u00e4rtus oli:

#poll
poll.taskmsg=Lisatud uus t\u00f6\u00f6\u00fclesanne, \u00fclesande number ''{0}''. Loomisaeg ''{1}''.

#modal dialgo demo
modal.demo.startnext=K\u00e4ivita j\u00e4rgmine
modal.demo.startnextoverlay=K\u00e4ivita j\u00e4rgmine modaalselt
modal.demo.previous=Tagasi eelmisele ekraanile
modal.demo.title=Modaalsed dialoogid
modal.demo.intro=M\u00f5nikord ei ole l\u00f5ppkasutajal soovitatav tegutseda paralleelselt mitmetes kasutuslugudes mis v\u00f5imaldaksid tal endale jalga tulistada. Selle v\u00e4ltimiseks saab Araneas kasutada modaalseid dialooge (kujundajate sl\u00e4ngis tuntud ka kui <i>overlay</i>) milles kasutaja saab segamatult kasutusloole keskenduda. Modaalsed dialoogid v\u00e4ldivad ka vajadust uute brauseriakende avamiseks &mdash; milline tegevus t\u00e4nap\u00e4evaste veebisirvijate puhul sageli ka eba\u00f5nnestub.
modal.demo.howto=Identse komponendi saab k\u00e4ivitada "K\u00e4ivita j\u00e4rgmine" ja "K\u00e4ivita j\u00e4rgmine modaalselt" nuppudega. Kui modaalne dialoog (<i>overlay</i> resiim) on aktiveeritud, k\u00e4ituvad m\u00f5lemad nupud samamoodi. Modaalresiimis t\u00f6\u00f6 l\u00f5petamisel (see juhtub kui "Tagasi eelmisele ekraanile" nuppu kasutada olukorras kus modaalresiimis eelmist ekraani ei eksisteeri) suunatakse kasutaja tagasi p\u00f5hikasutusloole.

#tree
servletcontext.tree.title=Paindlik puukomponent
servletcontext.tree.intro=Puu abil saab kergelt navigeerida keerukates hierarhilistes struktuurides. Andmekogu paikneb muidugi serveris, kasutajani saadetakse vaid need osad mida ta parajasti vaatab. Kuvatavad puud demonstreerivad \u00fchtlasi erinevaid meetodeid puu kommunikeerumiseks serveriga &mdash; \u00fclemine komponent on 'rumal' puu mis on osake terviklehest mis p\u00e4ringul alati kogu mahus serverisse saadetakse. Alumine puu on iseseisev ja suhtleb serveriga omap\u00e4i (kasutades <i>Aranea Action API</i> v\u00f5imalusi).
servletcontext.tree.more=Antud n\u00e4ites on k\u00f5ik puu lehed kuvatud \u00fchtemoodi, vajadusel v\u00f5ib selle k\u00e4itumise muuta ja kuvada erinevalt isegi igat puulehte.
servletcontext.treew.events='S\u00f5ltuv' puu:
servletcontext.treew.actions='Isep\u00e4ine' puu:

#tabs
tabs.intro=Kui kasutajal on palju v\u00f5imalusi on hea need loogiliselt eraldada. Sakid on kasutajaliidestes v\u00e4ga populaarsed, sest v\u00f5imaldavad just seda. Erinevates sakkides asuvate kasutuslugude vahel v\u00f5ib julgelt navigeerida, kartmata oleku kadumaminekut.

#simple editable list
SimpleEditableList=Redigeeritav list
sed.title=Redigeeritav list filtreerimise, muutmise, kustutamise ja lisamise toega
sed.Forename=Eesnimi
sed.Surname=Perenimi
sed.Sex=Sugu
sed.sexcon.ermsg=V\u00e4li ''{0}'' peab sisaldama \u00fcldlevinud sugusid ('M' v\u00f5i 'F').
sed.intro=Listid annavad kirjetest hea \u00fclevaate, kuid ei v\u00f5imalda kirjete kohest muutmist. Kiirete muudatuste lubamiseks saab aga kasutada redigeeritavaid liste.
sed.howtonavigate=Filtreerimine toimub kui t\u00e4ita m\u00f5ned filtriv\u00e4ljadest ning sisestusklahvi v\u00f5i 'Filtreeri' nuppu. Uue kirje saab lisada, t\u00e4ites listi allosas oleva vormi ja vajutades 'Lisa' nuppu. Kirje muutmiseks tuleb klikkida 'Muuda' nupul mis on olemas iga kirje jaoks.

#examples varia
person.add.form.label=Persooni lisamine
person.edit.form.label=Persooni muutmine
company.add.form.label=Kompanii lisamine
company.edit.form.label=Kompanii muutmine

#Aranea 1.1
Aranea_1_1=Aranea 1.1

#ARANEA 1.1 intro texts
aranea.welcome=Tere tulemast Aranea veebiraamistiku versiooni 1.1!
aranea.About.title=Mis on Aranea?
aranea.about=Aranea on avatud l\u00e4htekoodiga ning vaba tarkvara litsentsi alusel levitatav Java veebiraamistik. \
K\u00e4esolev demorakendus jookseb Aranea raamistikul ja selle eesm\u00e4rgiks on tutvustada Aranea veebiraamistiku p\u00f5hiomadusi \
ning tuua n\u00e4iteid Aranea Uilib'i valmiskomponentide ja Aranea JSP kasutusest. Uusimat informatsiooni \
Aranea veebiraamistiku kohta saab alati Aranea <a href="http://www.araneaframework.org/?pid=about">veebilehelt</a>.

aranea.what.title=Millised vahendeid pakub Aranea 1.1 veebirakenduste loomiseks?  
aranea.what.how=Esimese asjana vaadake ringi siinsamas rakenduses, v\u00e4ga paljud featuuride ja komponentide \
demod on vaid hiirekliki kaugusel.
aranea.whatsnew=Mida uut pakub Aranea 1.1?
aranea.wecomment=K\u00f5rge taseme \u00fclevaade muudatustest mis meie arvates teevad Aranea 1.1 &gt; 1.0
aranea.ComponentModel=Komponentmudel
aranea.component.scope=K\u00f5ik komponendid on n\u00fc\u00fcd teadlikud oma \
<a href="http://www.araneaframework.org/docs/1.1/javadoc/org/araneaframework/Scope.html">skoobist</a> &mdash; unikaalsest \
identifikaatorist komponendihierarhias. Aranea 1.0 versioonis oli see arendajate eest \u00fcsna peidus ja kasutatav ainult \
teatud tingimustel. Lihtne ligip\u00e4\u00e4s komponendi skoobile lihtsustab nii integratsiooni teiste raamistike komponentidega kui ka \
komponentide renderdamist.

aranea.component.lifecycle=<a href="http://www.araneaframework.org/docs/1.1/javadoc/org/araneaframework/Widget.html">Widget'i</a> \
(kasutajaliidese komponendi) eluts\u00fckkel on lihtsustunud <i>process()</i> meetodi eemaldamisega. Eluts\u00fcklis j\u00e4i \
see Aranea 1.0 versioonis kuularite k\u00e4ivitamise (<i>event()</i>) ja renderdamise vahele ning seet\u00f5ttu \
ahvatles m\u00f5nikord lisama sellesse loogikat mis ei t\u00f6\u00f6tanud kui kogu eluts\u00fckli l\u00e4bimise asemel oli komponenti tarvis \
ainult renderdada. Et v\u00e4ltida kasutajaliidese komponentide lihtobjektidest (<i>POJO</i>dest) millekski enamaks muutumast \
otsustati see meetod igaveseks eemaldada.

aranea.component.realasync=Komponentide vaikekompositsioon on transparentselt muudetud, lubamaks teatud tingimustel \
as\u00fcnkroonsete p\u00e4ringute paralleelt\u00f6\u00f6tlust. Aranea 1.0 versioonis t\u00f6\u00f6deldi sisemiselt k\u00f5ik p\u00e4ringud alati j\u00e4rjestikku. \
Vaikimisi on n\u00fc\u00fcdki k\u00f5igi p\u00e4ringute protsessimine j\u00e4rjestikune, kuid neil juhtudel kui arendaja/arhitekt t\u00f5esti \
soovivad on v\u00f5imalik kasutada p\u00e4ringute paralleelt\u00f6\u00f6tlust. Neil juhtudel peab m\u00f5istagi arendaja ise hoolt kandma selle \
eest, et vastavad komponendid ikka paralleelp\u00e4ringuid korrektselt t\u00f6\u00f6tlevad.

arenea.component.RenderingModel.title=Renderdusmudel
aranea.component.renderingmodeupdate=Aranea 1.0 versioonis renderdati alati korraga kogu komponendihierarhia. \
Aranea 1.1 teeb v\u00f5imalusel alati osalist renderdust &mdash; juhtudel kui p\u00e4ring defineerib uuendusregioonid renderdatakse \
v\u00e4him v\u00f5imalik osa komponendihierarhiast mis katab k\u00f5ik uuendusregioonid. \
Teooriast ja praktikast uue renderdusmudeli taga v\u00f5ib lugeda Alar Kvelli \
<a href="http://www.araneaframework.org/docs/kvell-aranea-ajax.pdf">bakalaureuset\u00f6\u00f6st</a>.
 
aranea.whattomigrate.title=Mida teha kui on soov migreeruda Aranea 1.0 -&gt; 1.1?
aranea.migration.help=Alustada tuleks migratsioonijuhendi lugemisega. Nendele k\u00fcsimustele millest sealt vastust ei leia v\u00f5ib k\u00fcsida \
vastust Aranea <a href="http://forum.araneaframework.org">foorumist</a>.

#END OF ARANEA 1.1 INTRO TEXTS


#labels
label.logout=Logi v\u00e4lja
label.mainpage=Pealehele

EnglishLang=Inglise keel
EstonianLang=Eesti keel

select.choose=-- vali --
